# Pandas

Pandas is a package used for managing data.

Pandas main use is that it creates 2 new data types for storing data: series and dataframe.

Think of a pandas dataframe like an excel spreadsheet that is storing some data.  One column can have customer name, one column can have product sold name, another column can have price or quantity... Then the rows could be individual sales.

A dataframe is made up of several series.  Each column of a dataframe is a series.

We can name each column and row of a dataframe.

A pandas dataframe is very similar to a data.frame in R.

Similar to numpy arrays, a dataframe is a more robust data type for storing data than lists of lists. Dataframes are more flexible than numpy arrays.

A numpy array can create a matrix with all entries of the same data type.  In a dataframe each column can have its own datatype.  

That's not to say numpy arrays aren't useful.  It is often easiest to convert some subset of a dataframe to a numpy array and then use that to do some math.

Pandas also has SQL-like functions for merging, joining, and sorting dataframes.

In [ ]:
import pandas as pd
import numpy as np  # numpy is not necessary for pandas, but we will use some np code in this example
# in general it's good practice to import all pacakages at the beginning

In [2]:
# first let's look at series - think of this as a single column of a spreadsheet
# each entry in a series corresponds to an individual row in the spreadsheet
# we can create a series by converting a list, or numpy array
import pandas as pd
import numpy as np
mylist = [5.4,6.1,1.7,99.8]
myarray = np.array(mylist)

In [3]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [4]:
# we access individual entries the same way as with lists and arrays
print(myseries1[2])

1.7

In [5]:
# we can add labels to the entries of a series

mylabels = ['first','second','third','fourth']
myseries3 = pd.Series(data=mylist,index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [7]:
# we need not be explicit about the entries of pd.Series
myseries4 = pd.Series(mylist,mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [8]:
# we can also access entries using the index labels
print(myseries4['second'])

6.1

In [9]:
# we can do math on series 
myseries5 = pd.Series([5.5,1.1,8.8,1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.9
fourth    108.6
second      NaN
third       2.8
dtype: float64

In [16]:
# we can combine series to create a dataframe using the concat function
df1 = pd.concat([myseries4,myseries5],axis=1,sort=False)
df1

           0    1
first    5.4  5.5
second   6.1  NaN
third    1.7  1.1
fourth  99.8  8.8
fifth    NaN  1.6

In [17]:
# we can create a new dataframe 
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0  0.465277  1.086879  1.012647  0.538633 -1.490683
1  0.511466 -0.741333 -0.602778 -1.852265 -0.083921
2  0.871529 -1.477034  1.224623 -0.952527  0.716931
3 -0.113037  0.476677  0.777321  1.105439 -0.233056
4  0.128186 -0.451413  0.200486 -0.448506 -1.074515

In [18]:
# lets give labels to rows and columns
df3 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row    1.005157    0.053162  -0.069226    0.101074  -0.762737
second row  -0.075700    0.699671   0.035569    0.445369   1.040777
third row    0.533715    0.081393   0.704987    0.097181  -0.720477
fourth row   0.117235   -0.254970   2.151014    0.268042   0.265942
fifth row   -1.005367    0.292532   0.509865    1.124299  -2.099091

In [27]:
# we can access individual series in a data frame
#print(df3['second col'])
df3['first col']
#print('')
#df3[['third col','first col']]
#print(df3)

first row     1.005157
second row   -0.075700
third row     0.533715
fourth row    0.117235
fifth row    -1.005367
Name: first col, dtype: float64

In [24]:
# we can access rows of a dataframe
df3.loc['fourth row']

first col     0.117235
second col   -0.254970
third col     2.151014
fourth col    0.268042
fifth col     0.265942
Name: fourth row, dtype: float64

In [25]:
df3.iloc[2]

first col     0.533715
second col    0.081393
third col     0.704987
fourth col    0.097181
fifth col    -0.720477
Name: third row, dtype: float64

In [26]:
df3.loc[['fourth row','first row'],['second col','third col']]

            second col  third col
fourth row   -0.254970   2.151014
first row     0.053162  -0.069226

In [ ]:
# we can use logical indexing for dataframes just like for numpy arrays
df3>0

In [ ]:
print(df3[df3>0])

In [39]:
# we can add columns to a dataframe
df3['sixth col'] = np.random.randn(5,1)
df3
df3['first col'] = np.random.randn(5,1)
df3

            second col  third col  fourth col  fifth col  sixth col  first col
first row     0.053162  -0.069226    0.101074  -0.762737   0.283495  -0.460363
second row    0.699671   0.035569    0.445369   1.040777  -1.040032  -0.174896
third row     0.081393   0.704987    0.097181  -0.720477   0.128615  -2.451740
fourth row   -0.254970   2.151014    0.268042   0.265942   0.011226  -0.092077
fifth row     0.292532   0.509865    1.124299  -2.099091  -0.094551  -0.966362

In [47]:
# we can remove columns or rows from a dataframe
df3['first col']= np.random.randn(5,1)
df3

            second col  third col  fourth col  fifth col  sixth col  first col
first row     0.053162  -0.069226    0.101074  -0.762737   0.283495   1.111291
second row    0.699671   0.035569    0.445369   1.040777  -1.040032   0.990010
third row     0.081393   0.704987    0.097181  -0.720477   0.128615   0.355076
fourth row   -0.254970   2.151014    0.268042   0.265942   0.011226  -1.551817
fifth row     0.292532   0.509865    1.124299  -2.099091  -0.094551   0.567418

In [49]:
df3.drop('first col',axis=1)
df3

            second col  third col  fourth col  fifth col  sixth col  first col
first row     0.053162  -0.069226    0.101074  -0.762737   0.283495   1.111291
second row    0.699671   0.035569    0.445369   1.040777  -1.040032   0.990010
third row     0.081393   0.704987    0.097181  -0.720477   0.128615   0.355076
fourth row   -0.254970   2.151014    0.268042   0.265942   0.011226  -1.551817
fifth row     0.292532   0.509865    1.124299  -2.099091  -0.094551   0.567418

In [ ]:
df4 = df3.drop('first col',axis=1)
df4

In [44]:
df5 = df3.drop('second row',axis=0)
df5

            second col  third col  fourth col  fifth col  sixth col
first row     0.053162  -0.069226    0.101074  -0.762737   0.283495
third row     0.081393   0.704987    0.097181  -0.720477   0.128615
fourth row   -0.254970   2.151014    0.268042   0.265942   0.011226
fifth row     0.292532   0.509865    1.124299  -2.099091  -0.094551

In [50]:
# we can remove a dataframe's index labels
df5.reset_index()

        index  second col  third col  fourth col  fifth col  sixth col
0   first row    0.053162  -0.069226    0.101074  -0.762737   0.283495
1   third row    0.081393   0.704987    0.097181  -0.720477   0.128615
2  fourth row   -0.254970   2.151014    0.268042   0.265942   0.011226
3   fifth row    0.292532   0.509865    1.124299  -2.099091  -0.094551

In [ ]:
df5

In [51]:
df5.reset_index(inplace=True)
df5

        index  second col  third col  fourth col  fifth col  sixth col
0   first row    0.053162  -0.069226    0.101074  -0.762737   0.283495
1   third row    0.081393   0.704987    0.097181  -0.720477   0.128615
2  fourth row   -0.254970   2.151014    0.268042   0.265942   0.011226
3   fifth row    0.292532   0.509865    1.124299  -2.099091  -0.094551

In [52]:
# we can assign new names to the index
df5['new name'] = ['This','is','the','row']
df5

,index,second col,third col,fourth col,fifth col,sixth col,new name
0,first row,0.053162,-0.069226,0.101074,-0.762737,0.283495,This
1,third row,0.081393,0.704987,0.097181,-0.720477,0.128615,is
2,fourth row,-0.254970,2.151014,0.268042,0.265942,0.011226,the
3,fifth row,0.292532,0.509865,1.124299,-2.099091,-0.094551,row

In [53]:
df5.set_index('new name',inplace=True)
df5

               index  second col  third col  fourth col  fifth col  sixth col
new name
This       first row    0.053162  -0.069226    0.101074  -0.762737   0.283495
is         third row    0.081393   0.704987    0.097181  -0.720477   0.128615
the       fourth row   -0.254970   2.151014    0.268042   0.265942   0.011226
row        fifth row    0.292532   0.509865    1.124299  -2.099091  -0.094551

# Combining data frames

The ways dataframes are combined in pandas is similar to SQL

We will examine 3 methods for combining dataframes

1. concat
2. join
3. merge

In [55]:


df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [61]:
pd.concat([df7,df8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [ ]:
pd.concat([df7,df8],axis=0,sort=True)

In [ ]:
pd.concat([df7,df8],axis=1,sort=False)

# Merge and Join

Merge combines dataframes using a column's values to identify common entries

Join combines dataframes using the index to identify common entries

In [ ]:
pd.merge(df7,df8,how='outer',on='customer') # outer merge is union of on

In [ ]:
pd.merge(df7,df8,how='inner',on='customer') # inner merge is intersection of on

In [ ]:
pd.merge(df7,df8,how='right',on='customer') # left merge is just first on, but all columns ... right is second

In [ ]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df10 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

In [ ]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels
df9.join(df10,how='right') # outer, inner, left, and right work the same as merge

In [ ]:
# let's now go over a few more basic functialities of pandas

df8['color'].unique()

In [ ]:
df8['color'].value_counts()

In [ ]:
df9.mean()

In [ ]:
df8.columns

In [ ]:
df8

In [ ]:
new_df = df8[(df8['customer']!='105') & (df8['color']!='green')]
new_df

In [ ]:
print(df8['sales'].sum())
print(df8['distance'].min())

In [ ]:
def profit(s):
    return s*0.5 # 50% markup...

In [ ]:
df8['sales'].apply(profit)

In [ ]:
df8['color'].apply(len)

In [ ]:
df11 = df8[['distance','sales']]
df11.applymap(profit)

In [ ]:
def col_sum(co):
    return sum(co)
df11.apply(col_sum)

In [ ]:
df11.applymap(col_sum)

In [ ]:
del df8['color']
df8

In [ ]:
df8.index

In [ ]:
df8.sort_values(by='distance',inplace=True)
df8

In [ ]:
df8

In [ ]:
# if some series has multiple of the same value then we can group all the unique entries together
mydict = {'customer': ['Customer 1','Customer 1','Customer2','Customer2','Customer3','Customer3'], 
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
          'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df6 = pd.DataFrame(mydict,index=['Purchase 1','Purchase 2','Purchase 3','Purchase 4','Purchase 5','Purchase 6'])
df6

In [ ]:
grouped_data = df6.groupby('customer')
print(grouped_data)

In [ ]:
grouped_data.std()

In [ ]:
df8

In [ ]:
# similar to numpy arrays, we can also save and load dataframes to csv files, and also Excel files

df8.to_csv('df8.csv',index=True)

In [ ]:
new_df8 = pd.read_csv('df8.csv',index_col=0)
new_df8

In [ ]:
df8.to_excel('df8.xlsx',index=False,sheet_name='first sheet')
newer_df8 = pd.read_excel('df8.xlsx',sheet_name='first sheet',index_col=1)
newer_df8